{
  "CSC": {
    "1000": {
      "title": "Technology Life Skills",
      "description": "In an age where information technology drives almost everything in our daily lives, it is important to have a basic understanding of how the technology works, what it means to us, and what risks we may be exposed to. This course provides an introduction to fundamental concepts in computing. Emphasis will include the impact of computing in academic disciplines and all aspects of society. Topics covered may include: a brief history of computing, computational thinking, the basics of programming, data representation (how sound and video are digitized), how computers work, operating systems and networks, the internet, building web pages, spreadsheets and data analytics, databases, social issues, security and privacy. Credit Hours: 4 Prerequisite: None",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "9:15 AM",
          "EndTime": "10:25 AM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        },
        "02": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "10:40 AM",
          "EndTime": "11:50 AM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        }
      }
    },
    "1210": {
      "title": "Web Site Development",
      "description": "An introduction to the technologies related to creation of a World Wide Web site. Emphasis will be placed on the latest languages and techniques used to create a dynamic site. Each student will participate in a series of projects that focuses on the creation of an interactive web site. Credit cannot be earned after successful completion of CSC 3212. Credit Hours: Four. Prerequisites: None.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W",
          "StartTime": "12:05 PM",
          "EndTime": "1:45 PM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 6,
          "Books": [],
          "Materials": []
        }
      }
    },
    "1710": {
      "title": "Intro. to Computer Programming",
      "description": "An introduction to the fundamentals of programming using a high-level, structured programming language such as C. Emphasis will be placed on syntax and semantics of the language to write correct, efficient, and easily modifiable programs. Topics include, but are not limited to, assignment statements, conditional and iterative control structures, functions, simple data structures, and software development. Credit Hours: Four. Prerequisites: None.",
      "Sections": {
        "01": {
          "Seats": 22,
          "MeetingDays": "M/W/F",
          "StartTime": "9:15 AM",
          "EndTime": "10:25 AM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        },
        "02": {
          "Seats": 16,
          "MeetingDays": "M/W/F",
          "StartTime": "10:40 AM",
          "EndTime": "11:50 AM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        },
        "03": {
          "Seats": 11,
          "MeetingDays": "M/W/F",
          "StartTime": "2:00 PM",
          "EndTime": "3:10 PM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        },
        "04": {
          "Seats": 24,
          "MeetingDays": "M/W/F",
          "StartTime": "3:25 PM",
          "EndTime": "4:35 PM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        }
      }
    },
    "1715": {
      "title": "Trans to UNIX Programming",
      "description": "An introduction to the UNIX operating system and utilities designed for students transitioning into the HPU computing environment. The course will also cover best coding practices applicable to any programming language. Prerequisites: Incoming Freshman or transfer students enrolled in CSC-1720 or higher. One Credit.",
      "Sections": {
        "01": {
          "Seats": 25,
          "MeetingDays": "M/W",
          "StartTime": "12:05 PM",
          "EndTime": "1:45 PM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 9,
          "Books": [],
          "Materials": []
        }
      }
    },
    "1720": {
      "title": "Adv Prog With Data Structures",
      "description": "This is a continuation of CSC 1710 covering more advanced fundamentals of programming including problem-solving strategies, the concept of an algorithm and basic data structures in an object-oriented language such as C++. Various programming concepts will be introduced such as recursion, string processing, classes, sorting, searching, linked lists, stacks, queues, and trees. Prerequisite: CSC-1710 with a grade of C- or higher Four credits. ",
      "Sections": {
        "01": {
          "Seats": 25,
          "MeetingDays": "M/W/F",
          "StartTime": "7:50 AM",
          "EndTime": "9:00 AM",
          "Room": "147",
          "Building": "Couch Hall",
          "Professor": 7,
          "Books": [],
          "Materials": []
        }
      }
    },
    "2212": {
      "title": "Database Systems",
      "description": "This course covers database design and the use of databases in web, mobile and cloud applications. It includes extensive coverage of the relational model, relational algebra, and SQL as well as NoSQL designs. The course also features database design and relational design principles based on dependencies and normal forms. There will be a programming project, which explores database design and management by utilizing appropriate features of SQL. Prerequisite: CSC-1720",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "T/Th",
          "StartTime": "7:50 AM",
          "EndTime": "9:30 AM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 10,
          "Books": [],
          "Materials": []
        }
      }
    },
    "2342": {
      "title": "Discrete Structures",
      "description": "This is an introductory course in discrete mathematical structures widely used computer science. The purpose of this course is to understand and use (abstract) discrete structures that are backbones of computer science. This course teaches the students techniques in how to think logically and mathematically and apply these techniques in solving problems. In particular, this class is meant to introduce logic, proofs, sets, relations, functions, counting, and probability, with an emphasis on applications in computer science. Credit Hours: Four. Prerequisite: CSC-1720 (CSC-1720 can be taken previously or concurrently with CSC-2342).",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "9:15 AM",
          "EndTime": "10:25 AM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 8,
          "Books": [],
          "Materials": []
        }
      }
    },
    "2410": {
      "title": "Computer Systems",
      "description": "An introduction to instruction set architecture, microarchitecture, and system architecture. Topics include basic computer organization, central processor and memory, addressing techniques, data representation, fundamental programming techniques in assembly and machine language as it relates to operating systems and high level languages. The course also includes exposure to networking and communication as well as parallel and distributed computing. Prerequisite: CSC 1720.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "7:50 AM",
          "EndTime": "9:00 AM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 8,
          "Books": [],
          "Materials": []
        }
      }
    },
    "2710": {
      "title": "Adv Data Structures/Algo Dev",
      "description": "This is a continuation of CSC-1720 where the focus is on algorithm development utilizing advanced data structures such as graphs and trees. Various programming strategies will be addressed such as greedy, divide and conquer, backtracking, branch and bound and dynamic programming. Other topics include recursion, algorithm analysis, object oriented programming and event driven programs. Credit Hours: Four Prerequisites: CSC-1720 with a grade of C- or higher AND MTH-1410 or equivalent.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "3:25 PM",
          "EndTime": "4:35 PM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 6,
          "Books": [],
          "Materials": []
        }
      }
    },
    "3312": {
      "title": "Mobile App Technologies",
      "description": "An introduction to the fundamentals of application development on mobile devices such as the cell phone or tablet. Students will work in an integrated development environment to write native apps for the selected platform. Current platforms include Xcode/iOS SDK or Android SDK. Emphasis will be placed on the user interface and the syntax and semantics of the language to write correct, efficient, and easily modifiable mobile applications. Prerequisite: CSC 2212 and CSC 2410.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "T/Th",
          "StartTime": "11:40 AM",
          "EndTime": "1:20 PM",
          "Room": "139/140",
          "Building": "Couch Hall",
          "Professor": 6,
          "Books": [],
          "Materials": []
        }
      }
    },
    "3460": {
      "title": "Networking/Network Programming",
      "description": "Networking and Network Programming An introduction to the basic concepts of network technologies and network programming. Attention will be given to a layer model such as the Open System Interconnect (OSI) model. Students will be engaged in projects that may include the implementation of a network application, networking technology assessment, network performance evaluation, and network administration. Four credits. Prerequisite: CSC-2710 CSC-2410 and CSC-2342.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W",
          "StartTime": "12:05 PM",
          "EndTime": "1:45 PM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 9,
          "Books": [],
          "Materials": []
        }
      }
    },
    "3820": {
      "title": "Penetration Testing",
      "description": "This course explores the foundational concepts, methods and techniques in preparing and conducting penetration tests on computing systems, networks, and applications. Throughout the course students engage in hands-on experiences as they unravel complex methods for exploiting common vulnerabilities in a variety of operating environments. Most importantly students learn how to construct a final report outlining discovered vulnerabilities, make suggested recommendations to remediate and/or mitigate those vulnerabilities. Students also learn how to describe the findings wherein non-technical personnel understand the ramifications of these vulnerabilities in a business sense.  Prerequisites: CSC-3810. Four Credits.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "T/Th",
          "StartTime": "7:50 AM",
          "EndTime": "9:30 AM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 9,
          "Books": [],
          "Materials": []
        }
      }
    },
    "3940": {
      "title": "System Security",
      "description": "A practical course covering the basic concepts that are essential to security of operating systems, networks, software and various computing support systems. Focus will be on creating and exploring systems with a vulnerability, recreating how attacks on the system exposed the vulnerability, system administration tasks related to system hardening, penetration testing, and security monitoring. Topics will include user account and privilege management, software installation, web site configuration, workstation cloning, clustering, and backups in a variety of environments including Linus, Mac OS X and Microsoft Windows. Prerequisite: CSC2410",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "T/Th",
          "StartTime": "1:35 PM",
          "EndTime": "3:15 PM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 9,
          "Books": [],
          "Materials": []
        }
      }
    },
    "4310": {
      "title": "High Performance Computing",
      "description": "A study of both hardware and software issues connected with solving a problem in a parallel processing environment which may include grid computing, cluster computing, or special hardware configurations such as a muti-core CPU/GPU processor. Emphasis will be placed on identifying the basic properties of bandwidth, latency, scalability and granularity as it relates to an algorithmic solution to a problem. Students will design, code, test and debug programs for stated environments. Prerequisite: CSC-2710 and CSC-2410.",
      "Sections": {
        "01": {
          "Seats": 30,
          "MeetingDays": "M/W/F",
          "StartTime": "3:25 PM",
          "EndTime": "4:35 PM",
          "Room": "130",
          "Building": "Couch Hall",
          "Professor": 9,
          "Books": [],
          "Materials": []
        }
      }
    },
    "4560": {
      "title": "Problem Solving Seminar",
      "description": "Problem Solving Seminar. Techniques for attacking and solving challenging problems from a variety of fields. Solutions will be implemented with a programming language such as Java or C++. Each student will be given the opportunity to participate in Local, Regional and International programming competitions. One credit. Prerequisite: CSC 1720 or permission of instructor.",
      "Sections": {
        "01": {
          "Seats": 25,
          "MeetingDays": "No Days",
          "StartTime": "No Time",
          "EndTime": "No Time",
          "Room": "No Room",
          "Building": "No Building",
          "Professor": 7,
          "Books": [],
          "Materials": []
        }
      }
    },
    "4910": {
      "title": "Undergraduate Research I",
      "description": "Undergraduate Research I. Investigation of some topic in computer science to a deeper and broader extent than typically done in a classroom situation. Two credits. Prerequisite: Junior status or permission of instructor.",
      "Sections": {
        "01": {
          "Seats": 25,
          "MeetingDays": "No Days",
          "StartTime": "No Time",
          "EndTime": "No Time",
          "Room": "No Room",
          "Building": "No Building",
          "Professor": 8,
          "Books": [],
          "Materials": []
        }
      }
    },
    "4920": {
      "title": "Undergraduate Research II",
      "description": "Undergraduate Research II. A continuation of CSC 4910. At the conclusion of the course, results will be given in both a written paper and an oral presentation to the seminar participants and the department faculty. Two credits. Prerequisite: CSC 4910.",
      "Sections": {
        "01": {
          "Seats": 25,
          "MeetingDays": "No Days",
          "StartTime": "No Time",
          "EndTime": "No Time",
          "Room": "No Room",
          "Building": "No Building",
          "Professor": 8,
          "Books": [],
          "Materials": []
        }
      }
    }
  }
}
